tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf8493_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18LF8493_H_
#define _PIC18LF8493_H_

#define LCDPS                         0
#define LP                            1
#define LP0                           2
#define LCDPS0                        3
#define LP1                           4
#define LCDPS1                        5
#define LP2                           6
#define LCDPS2                        7
#define LP3                           8
#define LCDPS3                        9
#define WA                            10
#define LCDA                          11
#define BIASMD                        12
#define WFT                           13
#define LCDCON                        14
#define LMUX0                         15
#define LMUX                          16
#define LMUX1                         17
#define LCDCON_CS                     18
#define CS0                           19
#define LCDCS0                        20
#define CS1                           21
#define LCDCS1                        22
#define WERR                          23
#define LCDWERR                       24
#define LCDSLPEN                      25
#define SLPEN                         26
#define LCDEN                         27
#define SE0                           28
#define SEGEN0                        29
#define LCDSE0                        30
#define SE1                           31
#define SEGEN1                        32
#define SE2                           33
#define SEGEN2                        34
#define SE3                           35
#define SEGEN3                        36
#define SE4                           37
#define SEGEN4                        38
#define SE5                           39
#define SEGEN5                        40
#define SE6                           41
#define SEGEN6                        42
#define SE7                           43
#define SEGEN7                        44
#define SE8                           45
#define SEGEN8                        46
#define LCDSE1                        47
#define SEGEN9                        48
#define SE9                           49
#define SEGEN10                       50
#define SE10                          51
#define SEGEN11                       52
#define SE11                          53
#define SEGEN12                       54
#define SE12                          55
#define SEGEN13                       56
#define SE13                          57
#define SEGEN14                       58
#define SE14                          59
#define SEGEN15                       60
#define SE15                          61
#define SEGEN16                       62
#define LCDSE2                        63
#define SE16                          64
#define SEGEN17                       65
#define SE17                          66
#define SEGEN18                       67
#define SE18                          68
#define SEGEN19                       69
#define SE19                          70
#define SE20                          71
#define SEGEN20                       72
#define SE21                          73
#define SEGEN21                       74
#define SEGEN22                       75
#define SE22                          76
#define SEGEN23                       77
#define SE23                          78
#define SE24                          79
#define SEGEN24                       80
#define LCDSE3                        81
#define SE25                          82
#define SEGEN25                       83
#define SE26                          84
#define SEGEN26                       85
#define SE27                          86
#define SEGEN27                       87
#define SE28                          88
#define SEGEN28                       89
#define SEGEN29                       90
#define SE29                          91
#define SE30                          92
#define SEGEN30                       93
#define SEGEN31                       94
#define SE31                          95
#define SE32                          96
#define SEGEN32                       97
#define LCDSE4                        98
#define SE33                          99
#define SEGEN33                       100
#define SE34                          101
#define SEGEN34                       102
#define SE35                          103
#define SEGEN35                       104
#define SE36                          105
#define SEGEN36                       106
#define SE37                          107
#define SEGEN37                       108
#define SE38                          109
#define SEGEN38                       110
#define SE39                          111
#define SEGEN39                       112
#define SE40                          113
#define SEGEN40                       114
#define LCDSE5                        115
#define SE41                          116
#define SEGEN41                       117
#define SE42                          118
#define SEGEN42                       119
#define SE43                          120
#define SEGEN43                       121
#define SE44                          122
#define SEGEN44                       123
#define SEGEN45                       124
#define SE45                          125
#define SE46                          126
#define SEGEN46                       127
#define SE47                          128
#define SEGEN47                       129
#define SEG0COM0                      130
#define LCDDATA0                      131
#define S00C0                         132
#define S0C0                          133
#define S01C0                         134
#define SEG1COM0                      135
#define S1C0                          136
#define S02C0                         137
#define S2C0                          138
#define SEG2COM0                      139
#define S03C0                         140
#define SEG3COM0                      141
#define S3C0                          142
#define SEG4COM0                      143
#define S4C0                          144
#define S04C0                         145
#define S5C0                          146
#define S05C0                         147
#define SEG5COM0                      148
#define SEG6COM0                      149
#define S6C0                          150
#define S06C0                         151
#define SEG7COM0                      152
#define S7C0                          153
#define S07C0                         154
#define S08C0                         155
#define LCDDATA1                      156
#define S8C0                          157
#define SEG8COM0                      158
#define SEG9COM0                      159
#define S09C0                         160
#define S9C0                          161
#define S10C0                         162
#define SEG10COM0                     163
#define S11C0                         164
#define SEG11COM0                     165
#define S12C0                         166
#define SEG12COM0                     167
#define S13C0                         168
#define SEG13COM0                     169
#define S14C0                         170
#define SEG14COM0                     171
#define SEG15COM0                     172
#define S15C0                         173
#define LCDDATA2                      174
#define S16C0                         175
#define SEG16COM0                     176
#define SEG17COM0                     177
#define S17C0                         178
#define SEG18COM0                     179
#define S18C0                         180
#define S19C0                         181
#define SEG19COM0                     182
#define S20C0                         183
#define SEG20COM0                     184
#define S21C0                         185
#define SEG21COM0                     186
#define SEG22COM0                     187
#define S22C0                         188
#define S23C0                         189
#define SEG23COM0                     190
#define LCDDATA3                      191
#define S24C0                         192
#define SEG24COM0                     193
#define S25C0                         194
#define SEG25COM0                     195
#define S26C0                         196
#define SEG26COM0                     197
#define SEG27COM0                     198
#define S27C0                         199
#define SEG28COM0                     200
#define S28C0                         201
#define SEG29COM0                     202
#define S29C0                         203
#define S30C0                         204
#define SEG30COM0                     205
#define SEG31COM0                     206
#define S31C0                         207
#define S32C0                         208
#define LCDDATA4                      209
#define SEG32COM0                     210
#define SEG33COM0                     211
#define S33C0                         212
#define S34C0                         213
#define SEG34COM0                     214
#define S35C0                         215
#define SEG35COM0                     216
#define S36C0                         217
#define SEG36COM0                     218
#define SEG37COM0                     219
#define S37C0                         220
#define S38C0                         221
#define SEG38COM0                     222
#define SEG39COM0                     223
#define S39C0                         224
#define LCDDATA5                      225
#define S40C0                         226
#define SEG40COM0                     227
#define S40C15                        228
#define SEG41COM0                     229
#define S41C0                         230
#define S42C0                         231
#define SEG42COM0                     232
#define S43C0                         233
#define SEG43COM0                     234
#define SEG44COM0                     235
#define S44C0                         236
#define S45C0                         237
#define SEG45COM0                     238
#define S46C0                         239
#define SEG46COM0                     240
#define S47C0                         241
#define SEG47COM0                     242
#define SEG0COM1                      243
#define LCDDATA6                      244
#define S00C1                         245
#define S0C1                          246
#define S01C1                         247
#define SEG1COM1                      248
#define S1C1                          249
#define S02C1                         250
#define S2C1                          251
#define SEG2COM1                      252
#define S03C1                         253
#define SEG3COM1                      254
#define S3C1                          255
#define SEG4COM1                      256
#define S4C1                          257
#define S04C1                         258
#define S5C1                          259
#define S05C1                         260
#define SEG5COM1                      261
#define SEG6COM1                      262
#define S6C1                          263
#define S06C1                         264
#define SEG7COM1                      265
#define S7C1                          266
#define S07C1                         267
#define LCDDATA7                      268
#define S08C1                         269
#define S8C1                          270
#define SEG8COM1                      271
#define SEG9COM1                      272
#define S09C1                         273
#define S9C1                          274
#define S10C1                         275
#define SEG10COM1                     276
#define S11C1                         277
#define SEG11COM1                     278
#define S12C1                         279
#define SEG12COM1                     280
#define S13C1                         281
#define SEG13COM1                     282
#define S14C1                         283
#define SEG14COM1                     284
#define SEG15COM1                     285
#define S15C1                         286
#define SEG16COM1                     287
#define LCDDATA8                      288
#define S16C1                         289
#define SEG17COM1                     290
#define S17C1                         291
#define SEG18COM1                     292
#define S18C1                         293
#define S19C1                         294
#define SEG19COM1                     295
#define S20C1                         296
#define SEG20COM1                     297
#define S21C1                         298
#define SEG21COM1                     299
#define SEG22COM1                     300
#define S22C1                         301
#define S23C1                         302
#define SEG23COM1                     303
#define S24C1                         304
#define SEG24COM1                     305
#define LCDDATA9                      306
#define S25C1                         307
#define SEG25COM1                     308
#define S26C1                         309
#define SEG26COM1                     310
#define SEG27COM1                     311
#define S27C1                         312
#define SEG28COM1                     313
#define S28C1                         314
#define SEG29COM1                     315
#define S29C1                         316
#define SEG30COM1                     317
#define S30C1                         318
#define S31C1                         319
#define SEG31COM1                     320
#define S32C1                         321
#define LCDDATA10                     322
#define SEG32COM1                     323
#define SEG33COM1                     324
#define S33C1                         325
#define S34C1                         326
#define SEG34COM1                     327
#define S35C1                         328
#define SEG35COM1                     329
#define S36C1                         330
#define SEG36COM1                     331
#define SEG37COM1                     332
#define S37C1                         333
#define S38C1                         334
#define SEG38COM1                     335
#define SEG39COM1                     336
#define S39C1                         337
#define RCSTA2                        338
#define RCD82                         339
#define RX9D2                         340
#define RCSTA2_RCD8                   341
#define RCSTA2_RX9D                   342
#define RCSTA2_OERR                   343
#define OERR2                         344
#define FERR2                         345
#define RCSTA2_FERR                   346
#define RCSTA2_ADEN                   347
#define ADDEN2                        348
#define RCSTA2_ADDEN                  349
#define RCSTA2_CREN                   350
#define CREN2                         351
#define SREN2                         352
#define RCSTA2_SREN                   353
#define RC92                          354
#define RCSTA2_RX9                    355
#define RCSTA2_RC9                    356
#define RC8_92                        357
#define RCSTA2_RC8_9                  358
#define nRC8                          359
#define NOT_RC8                       360
#define RX92                          361
#define RCSTA2_SPEN                   362
#define SPEN2                         363
#define TXSTA2                        364
#define TXSTA2_TXD8                   365
#define TX9D2                         366
#define TXSTA2_TX9D                   367
#define TXD82                         368
#define TRMT2                         369
#define TXSTA2_TRMT                   370
#define BRGH2                         371
#define TXSTA2_BRGH                   372
#define SENDB2                        373
#define TXSTA2_SYNC                   374
#define SYNC2                         375
#define TXEN2                         376
#define TXSTA2_TXEN                   377
#define TX8_92                        378
#define TX92                          379
#define TXSTA2_TX9                    380
#define NOT_TX8                       381
#define nTX8                          382
#define TXSTA2_TX8_9                  383
#define TXSTA2_CSRC                   384
#define CSRC2                         385
#define SEG40COM1                     386
#define S40C1                         387
#define LCDDATA11                     388
#define SEG41COM1                     389
#define S41C1                         390
#define ADMSK1                        391
#define SEG42COM1                     392
#define S42C1                         393
#define ADMSK2                        394
#define SEG43COM1                     395
#define S43C1                         396
#define ADMSK3                        397
#define SEG44COM1                     398
#define S44C1                         399
#define ADMSK4                        400
#define SEG45COM1                     401
#define S45C1                         402
#define ADMSK5                        403
#define S46C1                         404
#define SEG46COM1                     405
#define S47C1                         406
#define SEG47COM1                     407
#define SEG0COM2                      408
#define SSPM012                       409
#define LCDDATA12                     410
#define S00C2                         411
#define S0C2                          412
#define S01C2                         413
#define SSPM112                       414
#define SEG1COM2                      415
#define S1C2                          416
#define S02C2                         417
#define S2C2                          418
#define SEG2COM2                      419
#define SSPM212                       420
#define S03C2                         421
#define SEG3COM2                      422
#define S3C2                          423
#define SSPM312                       424
#define SEG4COM2                      425
#define S4C2                          426
#define S04C2                         427
#define S5C2                          428
#define S05C2                         429
#define SEG5COM2                      430
#define SEG6COM2                      431
#define S6C2                          432
#define S06C2                         433
#define SEG7COM2                      434
#define S7C2                          435
#define S07C2                         436
#define LCDDATA13                     437
#define S08C2                         438
#define S8C2                          439
#define SEG8COM2                      440
#define SEG9COM2                      441
#define S09C2                         442
#define S9C2                          443
#define S10C2                         444
#define SEG10COM2                     445
#define SEG11COM2                     446
#define S11C2                         447
#define S12C2                         448
#define SEG12COM2                     449
#define S13C2                         450
#define SEG13COM2                     451
#define S14C2                         452
#define SEG14COM2                     453
#define S15C2                         454
#define SEG15COM2                     455
#define SEG16COM2                     456
#define S16C2                         457
#define MSK0                          458
#define LCDDATA14                     459
#define S17C2                         460
#define MSK1                          461
#define SEG17COM2                     462
#define S18C2                         463
#define SEG18COM2                     464
#define MSK2                          465
#define S19C2                         466
#define SEG19COM2                     467
#define MSK3                          468
#define MSK4                          469
#define S20C2                         470
#define SEG20COM2                     471
#define MSK5                          472
#define S21C2                         473
#define SEG21COM2                     474
#define SEG22COM2                     475
#define MSK6                          476
#define S22C2                         477
#define SEG23COM2                     478
#define MSK7                          479
#define S23C2                         480
#define LCDDATA15                     481
#define S24C2                         482
#define SEG24COM2                     483
#define S25C2                         484
#define SEG25COM2                     485
#define S26C2                         486
#define SEG26COM2                     487
#define SEG27COM2                     488
#define S27C2                         489
#define S28C2                         490
#define SEG28COM2                     491
#define SEG29COM2                     492
#define S29C2                         493
#define SEG30COM2                     494
#define S30C2                         495
#define SEG31COM2                     496
#define S31C2                         497
#define S32C2                         498
#define LCDDATA16                     499
#define SEG32COM2                     500
#define T4CKPS016                     501
#define T4CKPS116                     502
#define SEG33COM2                     503
#define S33C2                         504
#define S34C2                         505
#define SEG34COM2                     506
#define T4OUTPS016                    507
#define S35C2                         508
#define SEG35COM2                     509
#define T4OUTPS116                    510
#define SEG36COM2                     511
#define S36C2                         512
#define T4OUTPS216                    513
#define S37C2                         514
#define SEG37COM2                     515
#define SEG38COM2                     516
#define S38C2                         517
#define T4OUTPS316                    518
#define SEG39COM2                     519
#define S39C2                         520
#define LCDDATA17                     521
