tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf8493_tdd.h
#define TRISD0                        1091
#define TRISD_RD1                     1092
#define TRISD1                        1093
#define TRISD_RD2                     1094
#define TRISD2                        1095
#define TRISD_RD3                     1096
#define TRISD3                        1097
#define TRISD_RD4                     1098
#define TRISD4                        1099
#define TRISD_RD5                     1100
#define TRISD5                        1101
#define TRISD_RD6                     1102
#define TRISD6                        1103
#define TRISD_RD7                     1104
#define TRISD7                        1105
#define TRISE                         1106
#define TRISE_RE4                     1107
#define TRISE4                        1108
#define TRISE_RE5                     1109
#define TRISE5                        1110
#define TRISE_RE6                     1111
#define TRISE6                        1112
#define TRISE_RE7                     1113
#define TRISE7                        1114
#define TRISF                         1115
#define TRISF0                        1116
#define TRISF_RF0                     1117
#define TRISF_RF1                     1118
#define TRISF1                        1119
#define TRISF_RF2                     1120
#define TRISF2                        1121
#define TRISF3                        1122
#define TRISF_RF3                     1123
#define TRISF_RF4                     1124
#define TRISF4                        1125
#define TRISF_RF5                     1126
#define TRISF5                        1127
#define TRISF_RF6                     1128
#define TRISF6                        1129
#define TRISF7                        1130
#define TRISF_RF7                     1131
#define TRISG                         1132
#define TRISG0                        1133
#define TRISG_RG0                     1134
#define TRISG1                        1135
#define TRISG_RG1                     1136
#define TRISG2                        1137
#define TRISG_RG2                     1138
#define TRISG_RG3                     1139
#define TRISG3                        1140
#define TRISG4                        1141
#define TRISG_RG4                     1142
#define TRISH                         1143
#define TRISH_RH0                     1144
#define TRISH0                        1145
#define TRISH_RH1                     1146
#define TRISH1                        1147
#define TRISH_RH2                     1148
#define TRISH2                        1149
#define TRISH_RH3                     1150
#define TRISH3                        1151
#define TRISH_RH4                     1152
#define TRISH4                        1153
#define TRISH_RH5                     1154
#define TRISH5                        1155
#define TRISH_RH6                     1156
#define TRISH6                        1157
#define TRISH_RH7                     1158
#define TRISH7                        1159
#define TRISJ                         1160
#define TRISJ_RJ0                     1161
#define TRISJ0                        1162
#define TRISJ_RJ1                     1163
#define TRISJ1                        1164
#define TRISJ_RJ2                     1165
#define TRISJ2                        1166
#define TRISJ_RJ3                     1167
#define TRISJ3                        1168
#define TRISJ_RJ4                     1169
#define TRISJ4                        1170
#define TRISJ_RJ5                     1171
#define TRISJ5                        1172
#define TRISJ_RJ6                     1173
#define TRISJ6                        1174
#define TRISJ_RJ7                     1175
#define TRISJ7                        1176
#define OSCTUNE                       1177
#define TUN0                          1178
#define TUN                           1179
#define TUN1                          1180
#define TUN2                          1181
#define TUN3                          1182
#define TUN4                          1183
#define PLLEN                         1184
#define INTSRC                        1185
#define MEMCON                        1186
#define WM                            1187
#define WM0                           1188
#define WM1                           1189
#define WAIT0                         1190
#define WAIT                          1191
#define WAIT1                         1192
#define EBDIS                         1193
#define PIE1                          1194
#define TMR1IE                        1195
#define TMR2IE                        1196
#define CCP1IE                        1197
#define SSPIE                         1198
#define TXIE                          1199
#define TX1IE                         1200
#define RCIE                          1201
#define RC1IE                         1202
#define ADIE                          1203
#define PIR1                          1204
#define TMR1IF                        1205
#define TMR2IF                        1206
#define CCP1IF                        1207
#define SSPIF                         1208
#define TXIF                          1209
#define TX1IF                         1210
#define RCIF                          1211
#define RC1IF                         1212
#define ADIF                          1213
#define IPR1                          1214
#define TMR1IP                        1215
#define TMR2IP                        1216
#define CCP1IP                        1217
#define SSPIP                         1218
#define TX1IP                         1219
#define TXIP                          1220
#define RC1IP                         1221
#define RCIP                          1222
#define ADIP                          1223
#define PIE2                          1224
#define CCP2IE                        1225
#define TMR3IE                        1226
#define HLVDIE                        1227
#define LVDIE                         1228
#define BCLIE                         1229
#define CMIE                          1230
#define OSCFIE                        1231
#define PIR2                          1232
#define CCP2IF                        1233
#define TMR3IF                        1234
#define HLVDIF                        1235
#define LVDIF                         1236
#define BCLIF                         1237
#define CMIF                          1238
#define OSCFIF                        1239
#define IPR2                          1240
#define CCP2IP                        1241
#define TMR3IP                        1242
#define HLVDIP                        1243
#define LVDIP                         1244
#define BCLIP                         1245
#define CMIP                          1246
#define OSCFIP                        1247
#define PIE3                          1248
#define TXB2IE                        1249
#define TX2IE                         1250
#define TXBNIE                        1251
#define RC2IE                         1252
#define LCDIE                         1253
#define PIR3                          1254
#define TX2IF                         1255
#define TXBNIF                        1256
#define RC2IF                         1257
#define LCDIF                         1258
#define IPR3                          1259
#define TXBNIP                        1260
#define TX2IP                         1261
#define RC2IP                         1262
#define LCDIP                         1263
#define RCSTA1                        1264
#define RCSTA1_RX9D                   1265
#define RX9D1                         1266
#define RCSTA1_RCD8                   1267
#define RCSTA1_OERR                   1268
#define OERR1                         1269
#define RCSTA1_FERR                   1270
#define FERR1                         1271
#define RCSTA1_ADDEN                  1272
#define RCSTA1_ADEN                   1273
#define ADDEN1                        1274
#define RCSTA1_CREN                   1275
#define CREN1                         1276
#define SRENA                         1277
#define SREN1                         1278
#define RCSTA1_SREN                   1279
#define RCSTA1_RC9                    1280
#define RCSTA1_RC8_9                  1281
#define RCSTA1_RX9                    1282
#define RX91                          1283
#define RCSTA1_SPEN                   1284
#define SPEN1                         1285
#define TXSTA1                        1286
#define TX9D1                         1287
#define TXSTA1_TX9D                   1288
#define TXSTA1_TXD8                   1289
#define TRMT1                         1290
#define TXSTA1_TRMT                   1291
#define BRGH1                         1292
#define TXSTA1_BRGH                   1293
#define SENDB1                        1294
#define SENDB                         1295
#define TXSTA1_SYNC                   1296
#define SYNC1                         1297
#define TXEN1                         1298
#define TXSTA1_TXEN                   1299
#define TX91                          1300
#define TXSTA1_TX8_9                  1301
#define TXSTA1_TX9                    1302
#define TXSTA1_CSRC                   1303
#define CSRC1                         1304
#define T3CON                         1305
#define TMR3ON                        1306
#define TMR3CS                        1307
#define nT3SYNC                       1308
#define NOT_T3SYNC                    1309
#define T3SYNC                        1310
#define T3INSYNC                      1311
#define SOSCEN3                       1312
#define T3CCP1                        1313
#define T3CKPS                        1314
#define T3CKPS0                       1315
#define T3CKPS1                       1316
#define T3CCP2                        1317
#define T3CON_RD16                    1318
#define RD163                         1319
#define T3RD16                        1320
#define CMCON                         1321
#define CM                            1322
#define CMEN0                         1323
#define CM0                           1324
#define CMEN1                         1325
#define CM1                           1326
#define CMEN2                         1327
#define CM2                           1328
#define CIS                           1329
#define C1INV                         1330
#define C2INV                         1331
#define C1OUT                         1332
#define C2OUT                         1333
#define CVRCON                        1334
#define CVR                           1335
#define CVR0                          1336
#define CVR1                          1337
#define CVR2                          1338
#define CVR3                          1339
#define CVRSS                         1340
#define CVREF                         1341
#define CVRR                          1342
#define CVROEN                        1343
#define CVROE                         1344
#define CVREN                         1345
#define CCP2CON                       1346
#define CCP2M                         1347
#define CCP2M0                        1348
#define CCP2M1                        1349
#define CCP2M2                        1350
#define CCP2M3                        1351
#define DC2B0                         1352
#define DCCP2Y                        1353
#define CCP2Y                         1354
#define DC2B                          1355
#define DC2B1                         1356
#define DCCP2X                        1357
#define CCP2X                         1358
#define CCP1CON                       1359
#define CCP1M0                        1360
#define CCP1M                         1361
#define CCP1M1                        1362
#define CCP1M2                        1363
#define CCP1M3                        1364
#define DCCP1Y                        1365
#define CCP1Y                         1366
#define DC1B                          1367
#define DC1B0                         1368
#define CCP1X                         1369
#define DCCP1X                        1370
#define DC1B1                         1371
#define ADCON2                        1372
#define ADCS0                         1373
#define ADCS                          1374
#define ADCS1                         1375
#define ADCS2                         1376
#define ACQT0                         1377
#define ACQT                          1378
#define ACQT1                         1379
#define ACQT2                         1380
#define ADFM                          1381
#define ADCON1                        1382
#define PCFG0                         1383
#define PCFG                          1384
#define PCFG1                         1385
#define PCFG2                         1386
#define CHSN3                         1387
#define PCFG3                         1388
#define VCFG                          1389
#define VCFG0                         1390
#define VCFG01                        1391
#define VCFG11                        1392
#define VCFG1                         1393
#define ADCON0                        1394
#define ADON                          1395
#define nDONE                         1396
#define GO_nDONE                      1397
#define NOT_DONE                      1398
#define GODONE                        1399
#define GO_DONE                       1400
#define DONE                          1401
#define GO_NOT_DONE                   1402
#define GO                            1403
#define CHS0                          1404
#define CHS                           1405
#define CHS1                          1406
#define CHS2                          1407
#define CHS3                          1408
#define SSPCON2                       1409
#define SEN                           1410
#define RSEN                          1411
#define PEN                           1412
#define RCEN                          1413
#define ACKEN                         1414
#define ACKDT                         1415
#define ACKSTAT                       1416
#define GCEN                          1417
#define SSPCON1                       1418
#define SSPM0                         1419
#define SSPM                          1420
#define SSPM1                         1421
#define SSPM2                         1422
#define SSPM3                         1423
#define CKP                           1424
#define SSPEN                         1425
#define SSPOV                         1426
#define WCOL                          1427
#define SSPSTAT                       1428
#define BF                            1429
#define UA                            1430
#define R_NOT_W                       1431
#define READ_WRITE                    1432
#define NOT_W                         1433
#define R_W                           1434
#define nW                            1435
#define RW                            1436
#define nWRITE                        1437
#define R                             1438
#define NOT_WRITE                     1439
#define R_nW                          1440
#define I2C_READ                      1441
#define START                         1442
#define S                             1443
#define I2C_START                     1444
#define STOP                          1445
#define I2C_STOP                      1446
#define P                             1447
#define NOT_A                         1448
#define DATA_ADDRESS                  1449
#define nA                            1450
#define D_A                           1451
#define D_nA                          1452
#define D                             1453
#define DA                            1454
#define D_NOT_A                       1455
#define NOT_ADDRESS                   1456
#define nADDRESS                      1457
#define I2C_DAT                       1458
#define CKE                           1459
#define SMP                           1460
#define T2CON                         1461
#define T2CKPS0                       1462
#define T2CKPS                        1463
#define T2CKPS1                       1464
#define TMR2ON                        1465
#define T2OUTPS0                      1466
#define TOUTPS                        1467
#define T2OUTPS1                      1468
#define T2OUTPS2                      1469
#define T2OUTPS3                      1470
#define T1CON                         1471
#define TMR1ON                        1472
#define TMR1CS                        1473
#define NOT_T1SYNC                    1474
#define T1SYNC                        1475
#define nT1SYNC                       1476
#define T1INSYNC                      1477
#define T1OSCEN                       1478
#define SOSCEN                        1479
#define T1CKPS0                       1480
#define T1CKPS                        1481
#define T1CKPS1                       1482
#define T1RUN                         1483
#define T1RD16                        1484
#define T1CON_RD16                    1485
#define RCON                          1486
#define BOR                           1487
#define NOT_BOR                       1488
#define nBOR                          1489
#define POR                           1490
#define nPOR                          1491
#define NOT_POR                       1492
#define PD                            1493
#define nPD                           1494
#define NOT_PD                        1495
#define NOT_TO                        1496
#define nTO                           1497
#define TO                            1498
#define nRI                           1499
#define NOT_RI                        1500
#define RI                            1501
#define SBOREN                        1502
#define IPEN                          1503
#define WDTCON                        1504
#define SWDTE                         1505
#define SWDTEN                        1506
#define HLVDCON                       1507
#define HLVDL                         1508
#define HLVDL0                        1509
#define LVV0                          1510
#define LVDL0                         1511
#define HLVDL1                        1512
#define LVV1                          1513
#define LVDL1                         1514
#define HLVDL2                        1515
#define LVV2                          1516
#define LVDL2                         1517
#define HLVDL3                        1518
#define LVV3                          1519
#define LVDL3                         1520
#define HLVDEN                        1521
#define LVDEN                         1522
#define BGST                          1523
#define IRVST                         1524
#define VDIRMAG                       1525
#define OSCCON                        1526
#define SCS0                          1527
#define SCS                           1528
#define SCS1                          1529
#define FLTS                          1530
#define IOFS                          1531
#define OSTS                          1532
#define IRCF                          1533
#define IRCF0                         1534
#define IRCF1                         1535
#define IRCF2                         1536
#define IDLEN                         1537
#define T0CON                         1538
#define T0PS                          1539
#define T0PS0                         1540
#define T0PS1                         1541
#define T0PS2                         1542
#define PSA                           1543
#define T0SE                          1544
#define T0CS                          1545
#define T08BIT                        1546
#define TMR0ON                        1547
#define STATUS                        1548
#define C                             1549
#define CARRY                         1550
#define DC                            1551
#define ZERO                          1552
#define Z                             1553
#define OV                            1554
#define OVERFLOW                      1555
#define N                             1556
#define NEGATIVE                      1557
#define INTCON3                       1558
#define INT1IF                        1559
#define INT1F                         1560
#define INT2IF                        1561
#define INT2F                         1562
#define INT3F                         1563
#define INT3IF                        1564
#define INT1E                         1565
#define INT1IE                        1566
#define INT2IE                        1567
#define INT2E                         1568
#define INT3E                         1569
#define INT3IE                        1570
#define INT1P                         1571
#define INT1IP                        1572
#define INT2IP                        1573
#define INT2P                         1574
#define INTCON2                       1575
#define RBIP                          1576
#define INT3IP                        1577
#define INT3P                         1578
#define TMR0IP                        1579
#define T0IP                          1580
#define INTEDG3                       1581
#define INTEDG2                       1582
#define INTEDG1                       1583
#define INTEDG0                       1584
#define RBPU                          1585
#define NOT_RBPU                      1586
#define nRBPU                         1587
#define INTCON                        1588
#define RBIF                          1589
#define INT0F                         1590
#define INT0IF                        1591
#define T0IF                          1592
#define TMR0IF                        1593
#define RBIE                          1594
#define INT0E                         1595
#define INT0IE                        1596
#define T0IE                          1597
#define TMR0IE                        1598
#define PEIE                          1599
#define PEIE_GIEL                     1600
#define GIEL                          1601
#define GIE_GIEH                      1602
#define GIE                           1603
#define GIEH                          1604
#define STKPTR0                       1605
#define STKPTR                        1606
#define STKPTR1                       1607
#define STKPTR2                       1608
#define STKPTR3                       1609
#define STKPTR4                       1610
#define STKUNF                        1611
#define STKOVF                        1612
#define STKFUL                        1613

#endif // _PIC18LF8493_H_
